In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder

import os

Since our data contains a lot of missing values with distinct character, let's define what data that could be classify as missing values

In [2]:
pd.set_option('display.max_rows', None)
missing_values=["--", "na", "NA", "n/a"]

In [3]:
names=["Kode Apartement", "Wilayah", "Sertifikat Milik", "Jumlah Kamar"]

In [4]:
df = pd.read_csv('./data.csv', delimiter=",", na_values=missing_values)
print(df)

   KodeApt   Wilayah St_Milik  Jum_kamar
0    104.0    Bantul        Y        3.0
1    197.0    Sleman        N        3.0
2      NaN    Sleman        N        NaN
3    201.0     Yogya       12        1.0
4    203.0     Yogya        Y        3.0
5    207.0     Yogya        Y        NaN
6      NaN  KL-Progo      NaN        2.0
7    213.0    Bantul        Y        NaN
8    215.0    Bantul        Y        NaN

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   KodeApt    7 non-null      float64
 1   Wilayah    9 non-null      object
 2   St_Milik   8 non-null      object
 3   Jum_kamar  5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 420.0+ bytes

Change data to null at St_Milik that is not string

In [6]:
iterate=0
for row in df["St_Milik"]:
    try:
        int(row)
        df.loc[iterate, "St_Milik"]=np.nan
    except ValueError:
        pass

    iterate += 1

Get total missing values for each column

In [7]:
df.isnull().sum()

KodeApt      2
Wilayah      0
St_Milik     2
Jum_kamar    4
dtype: int64

Get total missing values from the whole data

In [8]:
df.isnull().sum().sum()

8

In [9]:
iterate = 0
current_code = 1
for row in df["KodeApt"]:
    if np.isnan(row):
        if current_code not in  list(df["KodeApt"]):
            df.loc[iterate, "KodeApt"] = current_code
            current_code += 1
         
        
    iterate += 1

df["KodeApt"] = df["KodeApt"].astype(int)

print(df)

   KodeApt   Wilayah St_Milik  Jum_kamar
0      104    Bantul        Y        3.0
1      197    Sleman        N        3.0
2        1    Sleman        N        NaN
3      201     Yogya      NaN        1.0
4      203     Yogya        Y        3.0
5      207     Yogya        Y        NaN
6        2  KL-Progo      NaN        2.0
7      213    Bantul        Y        NaN
8      215    Bantul        Y        NaN

In [10]:
df["St_Milik"].fillna("N", inplace=True)
df

   KodeApt   Wilayah St_Milik  Jum_kamar
0      104    Bantul        Y        3.0
1      197    Sleman        N        3.0
2        1    Sleman        N        NaN
3      201     Yogya        N        1.0
4      203     Yogya        Y        3.0
5      207     Yogya        Y        NaN
6        2  KL-Progo        N        2.0
7      213    Bantul        Y        NaN
8      215    Bantul        Y        NaN

In [11]:
df["Jum_kamar"].fillna(df["Jum_kamar"].median(), inplace=True)
df

   KodeApt   Wilayah St_Milik  Jum_kamar
0      104    Bantul        Y        3.0
1      197    Sleman        N        3.0
2        1    Sleman        N        3.0
3      201     Yogya        N        1.0
4      203     Yogya        Y        3.0
5      207     Yogya        Y        3.0
6        2  KL-Progo        N        2.0
7      213    Bantul        Y        3.0
8      215    Bantul        Y        3.0

In [12]:
le = LabelEncoder()

for col in df.columns.values:
    if df[col].dtypes == "object":
        data = df[col]
        le.fit(data.values)
        df[col]=le.transform(df[col])

df.head(10)

   KodeApt  Wilayah  St_Milik  Jum_kamar
0      104        0         1        3.0
1      197        2         0        3.0
2        1        2         0        3.0
3      201        3         0        1.0
4      203        3         1        3.0
5      207        3         1        3.0
6        2        1         0        2.0
7      213        0         1        3.0
8      215        0         1        3.0

In [13]:
df.to_excel("result.xlsx", index=False)

In [14]:
df.to_csv("result.csv", index=False)